'''
1. คำนวณผลรวมของเบอร์โทรทั้งหมดและดูความหมายตามหลักเลขศาสตร์ ให้ได้เลขผลรวมดีมากหรือดี เช่น 36, 41, 45, 50, 51, 54, 55, 56, 59, 63 และอื่นๆ
   2. ควรใช้เลขถูกโฉลกให้มากที่สุด เช่น เกิดวันพฤหัส ควรให้มี 8 6 1 2 3 4   และ สามารถดูข้อมูลเพิ่มเติมได้ (เลื่อนลงด้านล่าง)
 เลขผลรวม สำหรับเบอร์โทรศัพท์
     # เลขผลรวมดีมาก ได้แก่ 9, 14, 15, 19, 23, 24, 32, 36, 40, 41, 42, 44, 45, 46, 50, 51, 54, 55, 56, 59, 63, 64, 65  ให้คุณระดับดีมาก
                                           69, 79 โอกาสประสบผลสำเร็จสูง อุปสรรคน้อย เจริญรุ่งเรือง ร่ำรวย รวดเร็ว และมีความสุข
     # เลขผลรวมดีปานกลาง ได้แก่ 10, 13, 16, 18, 20, 22, 25, 26, 28, 31, 35, 38, 39, 47, 49, 52, 53, 57, 58, 60, 61  ให้คุณระดับดีปานกลาง
                                           62, 66, 68, 74, 75 เหนื่อย มีอุปสรรค แต่ยังมีโอกาสประสบผลสำเร็จ หากมีความพยายาม
     # เลขผลรวมไม่ดี ได้แก่ 11, 12, 17, 21, 27, 29, 30, 33, 34, 37, 43, 48, 67, 70, 71, 72, 73, 76, 77, 78, 80 (ให้โทษ ใครได้ผลรวมเหล่านี้ควรเปลี่ยน)
                                           เหนื่อยมาก อุปสรรคมาก เจอปัญหารุมเร้า การงาน การเงิน ความรัก เกิดอุบัติเหตุชีวิตไม่จบไม่สิ้น
'''
def phone_number(a): #a = phone number is string
    sum = 0
    for c in a: #that is loop 1 character  "0932244819" that character for loop stroge in c
        sum = sum + int(c) #int(c) that is change str to int
    return sum

def interpret(number):
    verry_good = 9, 14, 15, 19, 23, 24, 32, 36, 40, 41, 42, 44, 45, 46, 50, 51, 54, 55, 56, 59, 63, 64, 65, 69, 79
    good = 10, 13, 16, 18, 20, 22, 25, 26, 28, 31, 35, 38, 39, 47, 49, 52, 53, 57, 58, 60, 61, 62, 66, 68, 74, 75  
    bad = 11, 12, 17, 21, 27, 29, 30, 33, 34, 37, 43, 48, 67, 70, 71, 72, 73, 76, 77, 78, 80 
    meaning =''
    if number in verry_good:
        meaning ='Number is verry good'
    elif number in good:
        meaning ='Number is good'
    else:
        meaning ='Number is bad'
    return meaning

# print(phone_number('12356'))
# n = phone_number('0891234567')
# print(n)
# print(interpret(n)) test!!!

phone = input('phone number is ') #string
# phone = phone_number(phone)
# print(interpret(phone))
print(interpret(phone_number(phone))) 